InformationRegisters/СогласующиеЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СогласующиеЦенНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСогласующего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыРасчетаЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроцентнойНаценкеНаБазовыйТип</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКанала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СогласованиеЦенНоменклатурыСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Запускает бизнес-процесс согласования цен по одной номенклатуре.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  ДатаПрименения - Дата - дата, когда цены должны начать действовать
//  ТаблицаЦен - ТаблицаЗначений, ДанныеФормыКоллекция - колонки как у табличной части Цены
//
// Возвращаемое значение:
//  БизнесПроцессСсылка.СогласованиеЦенНоменклатуры
//
Функция НачатьСогласование(Номенклатура, ДатаПрименения, ТаблицаЦен) Экспорт
	
	ТаблицаИсточник = ТаблицаИсточник(ТаблицаЦен);
	ОставитьТипыЦенСогласования(ТаблицаИсточник);
	ПроверитьВозможностьСтарта(Номенклатура, ДатаПрименения, ТаблицаИсточник);
	
	БизнесПроцесс = БизнесПроцессы.СогласованиеЦенНоменклатуры.СоздатьБизнесПроцесс();
	БизнесПроцесс.Дата = ТекущаяДата();
	БизнесПроцесс.Номенклатура = Номенклатура;
	БизнесПроцесс.ДатаПрименения = НачалоДня(ДатаПрименения);
	БизнесПроцесс.Инициатор = ПараметрыСеанса.ТекущийПользователь;
	БизнесПроцесс.АдресПочтыИнициатора = АдресЭлектроннойПочтыПользователя(БизнесПроцесс.Инициатор);
	Для Каждого СтрокаИсточника Из ТаблицаИсточник Цикл
		
		НоваяСтрока = БизнесПроцесс.Цены.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
		НоваяСтрока.ПроцентИзменения = ПроцентИзменения(НоваяСтрока.ЦенаСтарая, НоваяСтрока.Цена);
		
	КонецЦикла;
	
	БизнесПроцесс.Записать();
	БизнесПроцесс.Старт();
	
	Возврат БизнесПроцесс.Ссылка;
	
КонецФункции

// Согласующий с указанным номером из регистра сведений.
//
// Возвращаемое значение:
//  Структура - Пользователь, АдресЭлектроннойПочты. Неопределено, если записи нет.
//
Функция ПолучитьСогласующего(НомерСогласующего) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СогласующиеЦенНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерСогласующего = НомерСогласующего;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Или Не ЗначениеЗаполнено(МенеджерЗаписи.Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Адрес = СокрЛП(МенеджерЗаписи.АдресЭлектроннойПочты);
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Адрес = АдресЭлектроннойПочтыПользователя(МенеджерЗаписи.Пользователь);
	КонецЕсли;
	
	Возврат Новый Структура("Пользователь, АдресЭлектроннойПочты", МенеджерЗаписи.Пользователь, Адрес);
	
КонецФункции

Функция АдресЭлектроннойПочтыПользователя(Пользователь) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектыПоиска = Новый Массив;
	ОбъектыПоиска.Добавить(Пользователь);
	
	Попытка
		ФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизЛицо");
		Если ЗначениеЗаполнено(ФизЛицо) Тогда
			ОбъектыПоиска.Добавить(ФизЛицо);
		КонецЕсли;
	Исключение
		ЗаписатьОшибкуПочты(Пользователь, ИнформацияОбОшибке());
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объекты", ОбъектыПоиска);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление КАК Адрес
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В (&Объекты)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Представление <> """"";
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат СокрЛП(Выборка.Адрес);
		КонецЕсли;
	Исключение
		ЗаписатьОшибкуПочты(Пользователь, ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат "";
	
КонецФункции

Функция ЭтоКанал5(ТипЦен) Экспорт
	
	Возврат ТипЦен = Справочники.ТипыЦенНоменклатуры.Закупочная;
	
КонецФункции

Функция ЭтоКанал1(ТипЦен) Экспорт
	
	Возврат ТипЦен = Справочники.ТипыЦенНоменклатуры.Канал1;
	
КонецФункции

// Пересчет остальных каналов от закупочной цены (канал 5).
// Коэффициент и процент скидки строки не меняются.
//
Процедура ПересчитатьЦеныОтКанала5(ТаблицаЦен, Номенклатура) Экспорт
	
	СтрокаКанал5 = НайтиСтрокуПоТипуЦен(ТаблицаЦен, Справочники.ТипыЦенНоменклатуры.Закупочная);
	Если СтрокаКанал5 = Неопределено Или Не ЗначениеЗаполнено(СтрокаКанал5.Цена) Тогда
		ВызватьИсключение "Для " + Номенклатура + " не задана цена канала 5 (Закупочная)";
	КонецЕсли;
	
	СтавкаНДСЧисло = СтавкаНДСНоменклатуры(Номенклатура);
	СтрокаКанал5.ЦенаСНДС = ЦенаСНДС(СтрокаКанал5.Цена, СтавкаНДСЧисло);
	СтрокаКанал5.ПроцентИзменения = ПроцентИзменения(СтрокаКанал5.ЦенаСтарая, СтрокаКанал5.Цена);
	
	ЦенаКанал5 = СтрокаКанал5.Цена;
	ТипыПересчета = ТипыЦенПересчетаОтКанала5();
	
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		
		Если СтрокаЦен = СтрокаКанал5 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипыПересчета.Найти(СтрокаЦен.ТипЦен) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = Окр(ЦенаКанал5 * (1 + СтрокаЦен.КоэффициентКанала * СтрокаЦен.ПроцентСкидкиНаценки / 100), 2);
		СтрокаЦен.Цена = НоваяЦена;
		СтрокаЦен.ЦенаСНДС = ЦенаСНДС(НоваяЦена, СтавкаНДСЧисло);
		СтрокаЦен.ПроцентИзменения = ПроцентИзменения(СтрокаЦен.ЦенаСтарая, НоваяЦена);
		
	КонецЦикла;
	
КонецПроцедуры

// Цена строки изменилась. Для канала 5 пересчитываются остальные каналы,
// для остальных каналов пересчитывается коэффициент этой строки.
//
Процедура ПересчитатьПослеИзмененияЦены(ТаблицаЦен, ТипЦен, Номенклатура) Экспорт
	
	СтрокаЦен = НайтиСтрокуПоТипуЦен(ТаблицаЦен, ТипЦен);
	Если СтрокаЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКанал5(ТипЦен) Тогда
		ПересчитатьЦеныОтКанала5(ТаблицаЦен, Номенклатура);
		Возврат;
	КонецЕсли;
	
	СтавкаНДСЧисло = СтавкаНДСНоменклатуры(Номенклатура);
	СтрокаЦен.ЦенаСНДС = ЦенаСНДС(СтрокаЦен.Цена, СтавкаНДСЧисло);
	СтрокаЦен.ПроцентИзменения = ПроцентИзменения(СтрокаЦен.ЦенаСтарая, СтрокаЦен.Цена);
	ПересчитатьКоэффициентСтроки(ТаблицаЦен, СтрокаЦен);
	
КонецПроцедуры

// Коэффициент строки изменился. Цена пересчитывается от канала 5:
// Цена = ЦенаКанала5 * (1 + Коэффициент * ПроцентСкидкиНаценки / 100).
//
Процедура ПересчитатьПослеИзмененияКоэффициента(ТаблицаЦен, ТипЦен, Номенклатура) Экспорт
	
	Если ЭтоКанал5(ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЦен = НайтиСтрокуПоТипуЦен(ТаблицаЦен, ТипЦен);
	СтрокаКанал5 = НайтиСтрокуПоТипуЦен(ТаблицаЦен, Справочники.ТипыЦенНоменклатуры.Закупочная);
	Если СтрокаЦен = Неопределено Или СтрокаКанал5 = Неопределено Или Не ЗначениеЗаполнено(СтрокаКанал5.Цена) Тогда
		ВызватьИсключение "Для " + Номенклатура + " не задана цена канала 5 (Закупочная)";
	КонецЕсли;
	
	НоваяЦена = Окр(СтрокаКанал5.Цена * (1 + СтрокаЦен.КоэффициентКанала * СтрокаЦен.ПроцентСкидкиНаценки / 100), 2);
	СтрокаЦен.Цена = НоваяЦена;
	СтавкаНДСЧисло = СтавкаНДСНоменклатуры(Номенклатура);
	СтрокаЦен.ЦенаСНДС = ЦенаСНДС(НоваяЦена, СтавкаНДСЧисло);
	СтрокаЦен.ПроцентИзменения = ПроцентИзменения(СтрокаЦен.ЦенаСтарая, НоваяЦена);
	
КонецПроцедуры

// Создает документ установки или планового изменения и записывает ссылку в бизнес-процесс.
//
Процедура СоздатьДокументПоСогласованию(БизнесПроцессОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НачалоДня(БизнесПроцессОбъект.ДатаПрименения) <= НачалоДня(ТекущаяДата()) Тогда
		БизнесПроцессОбъект.ДокументУстановкиЦен = СоздатьУстановкуЦен(БизнесПроцессОбъект);
		БизнесПроцессОбъект.ДокументПлановогоИзменения = Документы.ПлановоеИзменениеЦен.ПустаяСсылка();
	Иначе
		БизнесПроцессОбъект.ДокументПлановогоИзменения = СоздатьПлановоеИзменение(БизнесПроцессОбъект);
		БизнесПроцессОбъект.ДокументУстановкиЦен = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	БизнесПроцессОбъект.Записать();
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОРезультате(БизнесПроцессОбъект) Экспорт
	
	Попытка
		ОтправитьПисьмо(АдресаИтоговогоУведомления(БизнесПроцессОбъект), ТемаИтога(БизнесПроцессОбъект), ТекстИтога(БизнесПроцессОбъект));
	Исключение
		ЗаписатьОшибкуПочты(БизнесПроцессОбъект.Ссылка, ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

// Оставляет в таблице только закупочную цену и типы из ТипыЦенПересчетаОтКанала5().
// Новые строки не добавляются.
//
Процедура ОставитьТипыЦенСогласования(ТаблицаЦен) Экспорт
	
	РазрешенныеТипы = ТипыЦенТабличнойЧастиСогласования();
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		Если РазрешенныеТипы.Найти(СтрокаЦен.ТипЦен) = Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрокаЦен);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЦен Из СтрокиКУдалению Цикл
		ТаблицаЦен.Удалить(СтрокаЦен);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет процент изменения по старой и новой цене каждой строки.
//
Процедура РассчитатьПроцентыИзменения(ТаблицаЦен) Экспорт
	
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		СтрокаЦен.ПроцентИзменения = ПроцентИзменения(СтрокаЦен.ЦенаСтарая, СтрокаЦен.Цена);
	КонецЦикла;
	
КонецПроцедуры

// Удаляет переданные бизнес-процессы и задачи без проверок и без пометки удаления.
// При удалении бизнес-процесса сначала удаляются его задачи.
//
Процедура УдалитьОбъектыНавсегда(Ссылки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Ссылка Из Ссылки Цикл
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеЦенНоменклатуры") Тогда
				УдалитьЗадачиБизнесПроцесса(Ссылка);
			КонецЕсли;
			
			УдалитьОбъектНавсегда(Ссылка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьПисьмоОтделуПродаж(БизнесПроцессОбъект) Экспорт
	
	Попытка
		АдресОтдела = СокрЛП(Константы.АдресПочтыОтделаПродаж.Получить());
		Если Не ЗначениеЗаполнено(АдресОтдела) Тогда
			ЗаписатьОшибкуПочты(БизнесПроцессОбъект.Ссылка,
				"Не заполнена константа ""Адрес почты отдела продаж"". Письмо о изменении цен не отправлено.");
			Возврат;
		КонецЕсли;
		
		Направление = НаправлениеИзменения(БизнесПроцессОбъект.Цены);
		Тема = "Запланировано " + Направление + " цен с " + Формат(БизнесПроцессОбъект.ДатаПрименения, "ДФ=dd.MM.yyyy");
		ОтправитьПисьмо(АдресОтдела, Тема, ТекстПисьмаОтделуПродаж(БизнесПроцессОбъект, Направление));
	Исключение
		ЗаписатьОшибкуПочты(БизнесПроцессОбъект.Ссылка, ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьСтарта(Номенклатура, ДатаПрименения, ТаблицаЦен)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ВызватьИсключение "Не заполнена номенклатура.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПрименения) Тогда
		ВызватьИсключение "Заполните дату применения новых цен.";
	КонецЕсли;
	
	Если НачалоДня(ДатаПрименения) < НачалоДня(ТекущаяДата()) Тогда
		ВызватьИсключение "Дата применения не может быть меньше текущей даты.";
	КонецЕсли;
	
	ТаблицаИсточник = ТаблицаИсточник(ТаблицаЦен);
	Если ТаблицаИсточник.Количество() = 0 Тогда
		ВызватьИсключение "Не заполнены цены для согласования.";
	КонецЕсли;
	
	Для Номер = 1 По 3 Цикл
		Если ПолучитьСогласующего(Номер) = Неопределено Тогда
			ВызватьИсключение "В регистре сведений ""Согласующие цен номенклатуры"" не заполнен согласующий " + Номер + ".";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаИсточник(ТаблицаЦен)
	
	Если ТипЗнч(ТаблицаЦен) = Тип("ТаблицаЗначений") Тогда
		Возврат ТаблицаЦен;
	КонецЕсли;
	
	Возврат ТаблицаЦен.Выгрузить();
	
КонецФункции

Функция НайтиСтрокуПоТипуЦен(ТаблицаЦен, ТипЦен)
	
	Строки = ТаблицаЦен.НайтиСтроки(Новый Структура("ТипЦен", ТипЦен));
	Возврат ?(Строки.Количество() > 0, Строки[0], Неопределено);
	
КонецФункции

Функция СтавкаНДСНоменклатуры(Номенклатура)
	
	СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СтавкаНДС");
	Возврат УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС);
	
КонецФункции

Функция ЦенаСНДС(Цена, СтавкаНДСЧисло)
	
	Возврат Окр(Цена * (1 + СтавкаНДСЧисло / 100), 2);
	
КонецФункции

Функция ПроцентИзменения(СтараяЦена, НоваяЦена)
	
	Если Не ЗначениеЗаполнено(СтараяЦена) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Окр((НоваяЦена / СтараяЦена - 1) * 100, 2);
	
КонецФункции

Процедура ПересчитатьКоэффициентСтроки(ТаблицаЦен, СтрокаЦен)
	
	СтрокаКанал5 = НайтиСтрокуПоТипуЦен(ТаблицаЦен, Справочники.ТипыЦенНоменклатуры.Закупочная);
	СтрокаКанал1 = НайтиСтрокуПоТипуЦен(ТаблицаЦен, Справочники.ТипыЦенНоменклатуры.Канал1);
	Если СтрокаКанал5 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦенаКанал5 = СтрокаКанал5.Цена;
	
	Если ЭтоКанал1(СтрокаЦен.ТипЦен) Тогда
		СтрокаЦен.КоэффициентКанала = 1;
		Если ЗначениеЗаполнено(ЦенаКанал5) Тогда
			СтрокаЦен.ПроцентСкидкиНаценки = Окр((СтрокаЦен.Цена / ЦенаКанал5) * 100 - 100, 2);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЦенаКанал1 = ?(СтрокаКанал1 = Неопределено, 0, СтрокаКанал1.Цена);
	Знаменатель = ЦенаКанал5 - ЦенаКанал1;
	Если Знаменатель = 0 Тогда
		СтрокаЦен.КоэффициентКанала = 0;
		Возврат;
	КонецЕсли;
	
	СтрокаЦен.КоэффициентКанала = Окр((ЦенаКанал5 - СтрокаЦен.Цена) / Знаменатель, 6);
	
КонецПроцедуры

Функция ТипыЦенТабличнойЧастиСогласования()
	
	ТипыЦен = Новый Массив;
	ТипыЦен.Добавить(Справочники.ТипыЦенНоменклатуры.Закупочная);
	
	Для Каждого ТипЦен Из ТипыЦенПересчетаОтКанала5() Цикл
		Если ЗначениеЗаполнено(ТипЦен) И ТипыЦен.Найти(ТипЦен) = Неопределено Тогда
			ТипыЦен.Добавить(ТипЦен);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипыЦен;
	
КонецФункции

Процедура УдалитьЗадачиБизнесПроцесса(БизнесПроцесс)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаСогласованияЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаСогласованияЦен КАК ЗадачаСогласованияЦен
	|ГДЕ
	|	ЗадачаСогласованияЦен.БизнесПроцесс = &БизнесПроцесс";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УдалитьОбъектНавсегда(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьОбъектНавсегда(Ссылка)
	
	ОбъектДанных = Ссылка.ПолучитьОбъект();
	Если ОбъектДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДанных.ОбменДанными.Загрузка = Истина;
	ПодготовитьОбъектКУдалению(ОбъектДанных);
	ОбъектДанных.ОбменДанными.Загрузка = Истина;
	ОбъектДанных.Удалить();
	
КонецПроцедуры

Процедура ПодготовитьОбъектКУдалению(ОбъектДанных)
	
	Попытка
		
		МетаданныеОбъекта = ОбъектДанных.Метаданные();
		Если Метаданные.Задачи.Содержит(МетаданныеОбъекта) И Не ОбъектДанных.Выполнена Тогда
			ОбъектДанных.Выполнена = Истина;
			ОбъектДанных.Записать();
		ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаданныеОбъекта) И ОбъектДанных.Стартован Тогда
			ОбъектДанных.Стартован = Ложь;
			ОбъектДанных.Записать();
		КонецЕсли;
		
	Исключение
		// Платформа может не дать снять признак старта. Само удаление выполняется дальше.
	КонецПопытки;
	
КонецПроцедуры

Функция ТипыЦенПересчетаОтКанала5()
	
	ТипыЦен = Новый Массив;
	ТипыЦен.Добавить(Справочники.ТипыЦенНоменклатуры.Краснодар);
	ТипыЦен.Добавить(Справочники.ТипыЦенНоменклатуры.Крым);
	
	Екатеринбург = ТипЦенЕкатеринбург();
	Если ЗначениеЗаполнено(Екатеринбург) Тогда
		ТипыЦен.Добавить(Екатеринбург);
	КонецЕсли;
	
	Для НомерКанала = 1 По 4 Цикл
		ТипыЦен.Добавить(Справочники.ТипыЦенНоменклатуры["Канал" + НомерКанала]);
	КонецЦикла;
	
	Возврат ТипыЦен;
	
КонецФункции

Функция ТипЦенЕкатеринбург()
	
	Возврат Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Екатеринбург", Истина);
	
КонецФункции

Функция ТипЦеныПоНомеруКанала(НомерКанала)
	
	Если НомерКанала = 5 Тогда
		Возврат Справочники.ТипыЦенНоменклатуры.Закупочная;
	КонецЕсли;
	
	Возврат Справочники.ТипыЦенНоменклатуры["Канал" + НомерКанала];
	
КонецФункции

Функция СоздатьУстановкуЦен(БизнесПроцессОбъект)
	
	ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Информация = Лев(ПредставлениеТиповЦен(БизнесПроцессОбъект.Цены), 200);
	ДокументОбъект.Комментарий = КомментарийДокумента(БизнесПроцессОбъект);
	УстановитьЕслиЕсть(ДокументОбъект, "Ответственный", БизнесПроцессОбъект.Инициатор);
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ЕдиницаПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БизнесПроцессОбъект.Номенклатура, "ЕдиницаХраненияОстатков");
	ЕстьКоэффициент = ЕстьРеквизитТабличнойЧасти("УстановкаЦенНоменклатуры", "Товары", "КоэффициентКанала");
	
	УжеДобавленныеТипы = Новый Соответствие;
	Для Каждого СтрокаЦен Из БизнесПроцессОбъект.Цены Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЦен.ТипЦен) Или УжеДобавленныеТипы[СтрокаЦен.ТипЦен] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТипа = ДокументОбъект.ТипыЦен.Добавить();
		СтрокаТипа.ТипЦен = СтрокаЦен.ТипЦен;
		УжеДобавленныеТипы.Вставить(СтрокаЦен.ТипЦен, Истина);
		
		СтрокаТовара = ДокументОбъект.Товары.Добавить();
		СтрокаТовара.Номенклатура = БизнесПроцессОбъект.Номенклатура;
		СтрокаТовара.ТипЦен = СтрокаЦен.ТипЦен;
		СтрокаТовара.Цена = СтрокаЦен.Цена;
		СтрокаТовара.Валюта = Валюта;
		СтрокаТовара.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(СтрокаЦен.ЕдиницаИзмерения), СтрокаЦен.ЕдиницаИзмерения, ЕдиницаПоУмолчанию);
		СтрокаТовара.ПроцентСкидкиНаценки = СтрокаЦен.ПроцентСкидкиНаценки;
		СтрокаТовара.СпособРасчетаЦены = ?(ЗначениеЗаполнено(СтрокаЦен.СпособРасчетаЦены),
			СтрокаЦен.СпособРасчетаЦены,
			Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип);
		СтрокаТовара.ИндексСтрокиТаблицыЦен = 1;
		
		Если ЕстьКоэффициент И Не ЭтоКанал5(СтрокаЦен.ТипЦен) Тогда
			СтрокаТовара.КоэффициентКанала = СтрокаЦен.КоэффициентКанала;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Функция СоздатьПлановоеИзменение(БизнесПроцессОбъект)
	
	ДокументОбъект = Документы.ПлановоеИзменениеЦен.СоздатьДокумент();
	ДокументОбъект.Дата = БизнесПроцессОбъект.ДатаПрименения;
	УстановитьЕслиЕсть(ДокументОбъект, "Комментарий", КомментарийДокумента(БизнесПроцессОбъект));
	УстановитьЕслиЕсть(ДокументОбъект, "ЦеныСНДС", Ложь);
	УстановитьЕслиЕсть(ДокументОбъект, "Ответственный", БизнесПроцессОбъект.Инициатор);
	
	ТабличнаяЧасть = ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Товары");
	Если ТабличнаяЧасть = Неопределено Тогда
		ВызватьИсключение "У документа ПлановоеИзменениеЦен нет табличной части Товары.";
	КонецЕсли;
	
	СтрокаТовара = ДокументОбъект.Товары.Добавить();
	СтрокаТовара.Номенклатура = БизнесПроцессОбъект.Номенклатура;
	
	СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БизнесПроцессОбъект.Номенклатура, "СтавкаНДС");
	УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "СтавкаНДС", СтавкаНДС);
	
	Для НомерКанала = 1 По 5 Цикл
		
		СтрокаЦен = НайтиСтрокуПоТипуЦен(БизнесПроцессОбъект.Цены, ТипЦеныПоНомеруКанала(НомерКанала));
		Если СтрокаЦен = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "ЦенаКанал" + НомерКанала, СтрокаЦен.Цена);
		УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "ЦенаСНДСКанал" + НомерКанала, СтрокаЦен.ЦенаСНДС);
		
	КонецЦикла;
	
	ЗаполнитьРегиональнуюЦену(СтрокаТовара, ТабличнаяЧасть, БизнесПроцессОбъект, "Краснодар", Справочники.ТипыЦенНоменклатуры.Краснодар);
	ЗаполнитьРегиональнуюЦену(СтрокаТовара, ТабличнаяЧасть, БизнесПроцессОбъект, "Крым", Справочники.ТипыЦенНоменклатуры.Крым);
	ЗаполнитьРегиональнуюЦену(СтрокаТовара, ТабличнаяЧасть, БизнесПроцессОбъект, "Екатеринбург", ТипЦенЕкатеринбург());
	
	СтрокаКанал5 = НайтиСтрокуПоТипуЦен(БизнесПроцессОбъект.Цены, Справочники.ТипыЦенНоменклатуры.Закупочная);
	ЦенаКанал5 = ?(СтрокаКанал5 = Неопределено, 0, СтрокаКанал5.Цена);
	УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "ЦенаИзменения", ЦенаКанал5);
	
	ТекущаяЦена = Ценообразование.ПолучитьЦенуНоменклатуры(БизнесПроцессОбъект.Номенклатура, , Справочники.ТипыЦенНоменклатуры.Закупочная);
	УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "Цена", ТекущаяЦена);
	
	Если ТабличнаяЧасть.Реквизиты.Найти("СуммаИзменения") <> Неопределено
		И ТабличнаяЧасть.Реквизиты.Найти("ЦенаИзменения") <> Неопределено
		И ТабличнаяЧасть.Реквизиты.Найти("Цена") <> Неопределено Тогда
		
		СтрокаТовара.СуммаИзменения = СтрокаТовара.ЦенаИзменения - СтрокаТовара.Цена;
		Если ТабличнаяЧасть.Реквизиты.Найти("ПроцентИзменения") <> Неопределено Тогда
			СтрокаТовара.ПроцентИзменения = ?(СтрокаТовара.Цена > 0, (СтрокаТовара.СуммаИзменения / СтрокаТовара.Цена) * 100, 0);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокументОбъект.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокументОбъект.Записать();
	КонецЕсли;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьРегиональнуюЦену(СтрокаТовара, ТабличнаяЧасть, БизнесПроцессОбъект, ИмяПоля, ТипЦен)
	
	СтрокаЦен = Неопределено;
	Если ЗначениеЗаполнено(ТипЦен) Тогда
		СтрокаЦен = НайтиСтрокуПоТипуЦен(БизнесПроцессОбъект.Цены, ТипЦен);
	КонецЕсли;
	
	Если СтрокаЦен = Неопределено Тогда
		СтрокаЦен = НайтиСтрокуПоТипуЦен(БизнесПроцессОбъект.Цены, Справочники.ТипыЦенНоменклатуры.Канал1);
	КонецЕсли;
	
	Если СтрокаЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "Цена" + ИмяПоля, СтрокаЦен.Цена);
	УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, "ЦенаСНДС" + ИмяПоля, СтрокаЦен.ЦенаСНДС);
	
КонецПроцедуры

Функция ПредставлениеТиповЦен(ТаблицаЦен)
	
	Имена = Новый Массив;
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		Если ЗначениеЗаполнено(СтрокаЦен.ТипЦен) Тогда
			Имена.Добавить(Строка(СтрокаЦен.ТипЦен));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоединитьСтроки(Имена, ", ");
	
КонецФункции

Функция КомментарийДокумента(БизнесПроцессОбъект)
	
	Возврат "#Создано бизнес-процессом согласования цен " + БизнесПроцессОбъект.Номер;
	
КонецФункции

Функция ЕстьРеквизитТабличнойЧасти(ИмяДокумента, ИмяТабличнойЧасти, ИмяРеквизита)
	
	ТабличнаяЧасть = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	Если ТабличнаяЧасть = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	
КонецФункции

Процедура УстановитьЕслиЕсть(ДокументОбъект, ИмяРеквизита, Значение)
	
	Если ДокументОбъект.Метаданные().Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект[ИмяРеквизита] = Значение;
	
КонецПроцедуры

Процедура УстановитьРеквизитСтроки(СтрокаТовара, ТабличнаяЧасть, ИмяРеквизита, Значение)
	
	Если ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТовара[ИмяРеквизита] = Значение;
	
КонецПроцедуры

Функция АдресаИтоговогоУведомления(БизнесПроцессОбъект)
	
	Адреса = Новый Массив;
	ДобавитьАдрес(Адреса, БизнесПроцессОбъект.АдресПочтыИнициатора);
	
	Если Не ЗначениеЗаполнено(БизнесПроцессОбъект.АдресПочтыИнициатора) Тогда
		ДобавитьАдрес(Адреса, АдресЭлектроннойПочтыПользователя(БизнесПроцессОбъект.Инициатор));
	КонецЕсли;
	
	Для Номер = 2 По 3 Цикл
		Согласующий = ПолучитьСогласующего(Номер);
		Если Согласующий <> Неопределено Тогда
			ДобавитьАдрес(Адреса, Согласующий.АдресЭлектроннойПочты);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоединитьСтроки(Адреса, "; ");
	
КонецФункции

Процедура ДобавитьАдрес(Адреса, Адрес)
	
	Адрес = СокрЛП(Адрес);
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Возврат;
	КонецЕсли;
	
	Если Адреса.Найти(Адрес) = Неопределено Тогда
		Адреса.Добавить(Адрес);
	КонецЕсли;
	
КонецПроцедуры

Функция ТемаИтога(БизнесПроцессОбъект)
	
	Результат = ?(БизнесПроцессОбъект.Согласовано, "согласовано", "не согласовано");
	Возврат "Согласование цен " + БизнесПроцессОбъект.Номенклатура + ": " + Результат;
	
КонецФункции

Функция ТекстИтога(БизнесПроцессОбъект)
	
	Строки = Новый Массив;
	Строки.Добавить("Номенклатура: " + БизнесПроцессОбъект.Номенклатура);
	Строки.Добавить("Дата применения: " + Формат(БизнесПроцессОбъект.ДатаПрименения, "ДФ=dd.MM.yyyy"));
	Строки.Добавить("Инициатор: " + БизнесПроцессОбъект.Инициатор);
	Строки.Добавить("Итог: " + ?(БизнесПроцессОбъект.Согласовано, "согласовано согласующим 3", "отказано согласующим 3"));
	Строки.Добавить("");
	
	Для Номер = 1 По 3 Цикл
		Строки.Добавить(ТекстРешенияСогласующего(БизнесПроцессОбъект, Номер));
	КонецЦикла;
	
	Если БизнесПроцессОбъект.Согласовано Тогда
		Строки.Добавить("");
		Если ЗначениеЗаполнено(БизнесПроцессОбъект.ДокументУстановкиЦен) Тогда
			Строки.Добавить("Создан документ установки цен: " + БизнесПроцессОбъект.ДокументУстановкиЦен);
		КонецЕсли;
		Если ЗначениеЗаполнено(БизнесПроцессОбъект.ДокументПлановогоИзменения) Тогда
			Строки.Добавить("Создан документ планового изменения цен: " + БизнесПроцессОбъект.ДокументПлановогоИзменения);
		КонецЕсли;
	КонецЕсли;
	
	Строки.Добавить("");
	Строки.Добавить(ТекстТаблицыЦен(БизнесПроцессОбъект.Цены));
	
	Возврат СоединитьСтроки(Строки, Символы.ПС);
	
КонецФункции

Функция ТекстРешенияСогласующего(БизнесПроцессОбъект, Номер)
	
	Если Не БизнесПроцессОбъект["СогласованиеВыполнено" + Номер] Тогда
		Результат = "нет решения";
	ИначеЕсли БизнесПроцессОбъект["РезультатСогласования" + Номер] Тогда
		Результат = "согласовано";
	Иначе
		Результат = "отказано";
	КонецЕсли;
	
	Согласующий = ПолучитьСогласующего(Номер);
	Имя = ?(Согласующий = Неопределено, "", " (" + Согласующий.Пользователь + ")");
	Текст = "Согласующий " + Номер + Имя + ": " + Результат;
	Комментарий = СокрЛП(БизнесПроцессОбъект["Комментарий" + Номер]);
	Если ЗначениеЗаполнено(Комментарий) Тогда
		Текст = Текст + ". Комментарий: " + Комментарий;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПисьмаОтделуПродаж(БизнесПроцессОбъект, Направление)
	
	Строки = Новый Массив;
	Строки.Добавить("Запланировано " + Направление + " цен.");
	Строки.Добавить("Номенклатура: " + БизнесПроцессОбъект.Номенклатура);
	Строки.Добавить("Дата применения: " + Формат(БизнесПроцессОбъект.ДатаПрименения, "ДФ=dd.MM.yyyy"));
	Строки.Добавить("");
	Строки.Добавить(ТекстТаблицыЦен(БизнесПроцессОбъект.Цены));
	Возврат СоединитьСтроки(Строки, Символы.ПС);
	
КонецФункции

Функция ТекстТаблицыЦен(ТаблицаЦен)
	
	Строки = Новый Массив;
	Строки.Добавить("Тип цен; Старая цена; Новая цена; % изменения; Коэффициент");
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		Строки.Добавить(Строка(СтрокаЦен.ТипЦен)
			+ "; " + Формат(СтрокаЦен.ЦенаСтарая, "ЧДЦ=2; ЧГ=0")
			+ "; " + Формат(СтрокаЦен.Цена, "ЧДЦ=2; ЧГ=0")
			+ "; " + Формат(СтрокаЦен.ПроцентИзменения, "ЧДЦ=2; ЧГ=0")
			+ "; " + Формат(СтрокаЦен.КоэффициентКанала, "ЧДЦ=6; ЧГ=0"));
	КонецЦикла;
	Возврат СоединитьСтроки(Строки, Символы.ПС);
	
КонецФункции

Функция НаправлениеИзменения(ТаблицаЦен)
	
	СтрокаКанал5 = НайтиСтрокуПоТипуЦен(ТаблицаЦен, Справочники.ТипыЦенНоменклатуры.Закупочная);
	ПроцентКанала5 = ?(СтрокаКанал5 = Неопределено, 0, СтрокаКанал5.ПроцентИзменения);
	Если ПроцентКанала5 > 0 Тогда
		Возврат "повышение";
	ИначеЕсли ПроцентКанала5 < 0 Тогда
		Возврат "понижение";
	КонецЕсли;
	
	ЕстьПовышение = Ложь;
	ЕстьПонижение = Ложь;
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		Если СтрокаЦен.ПроцентИзменения > 0 Тогда
			ЕстьПовышение = Истина;
		ИначеЕсли СтрокаЦен.ПроцентИзменения < 0 Тогда
			ЕстьПонижение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПовышение И Не ЕстьПонижение Тогда
		Возврат "повышение";
	ИначеЕсли ЕстьПонижение И Не ЕстьПовышение Тогда
		Возврат "понижение";
	КонецЕсли;
	
	Возврат "изменение";
	
КонецФункции

Процедура ОтправитьПисьмо(Адреса, Тема, Текст)
	
	Если Не ЗначениеЗаполнено(Адреса) Тогда
		ВызватьИсключение "Нет адресов для отправки письма """ + Тема + """.";
	КонецЕсли;
	
	УчетнаяЗапись = Константы.УчетнаяЗаписьПочтыСогласованияЦен.Получить();
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение "Не заполнена константа ""Учетная запись почты согласования цен"".";
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Адреса);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", Текст);
	
	ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	
КонецПроцедуры

Функция СоединитьСтроки(Строки, Разделитель)
	
	Результат = "";
	Для Индекс = 0 По Строки.Количество() - 1 Цикл
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		Результат = Результат + Строка(Строки[Индекс]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьОшибкуПочты(Ссылка, ИнформацияОбОшибкеИлиТекст)
	
	Если ТипЗнч(ИнформацияОбОшибкеИлиТекст) = Тип("ИнформацияОбОшибке") Тогда
		Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибкеИлиТекст);
	Иначе
		Текст = Строка(ИнформацияОбОшибкеИлиТекст);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		"СогласованиеЦен.Почта",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.БизнесПроцессы.СогласованиеЦенНоменклатуры,
		Ссылка,
		Текст);
	
КонецПроцедуры

#КонецОбласти
